angular.module("application").controller('mainPageController', MainPageController);

function MainPageController($scope) {

    $scope.aboutCampusInfo = [
        {
            "id": 1,
            "header": "ПМ «Особисті дані»",
            "description": "Відображення особистих даних про студента або співробітника на веб-сторінці відповідного віртуального кабінету користувача ІТС ЕК з можливістю редагування особистих даних (контактний телефон, E-mail, ICQ, фотографія тощо) та зміни видимості особистої інформації для інших користувачів ІТС ЕК."
        },
        {
            "id": 2,
            "header": "ПМ «Повідомлення, Особисті»",
            "description": "Відправлення повідомлень групам користувачів або окремому користувачу. Перегляд, видалення повідомлень в віртуального кабінету, що надійшли від користувачів."
        },
        {
            "id": 3,
            "header": "ПМ «Повідомлення, Навчальна група»",
            "description": "Відправлення повідомлень навчальній групі. Перегляд повідомлень, що написані навчальній групі студентів як студентами групи так і викладачами-науковцями, що читають в даній групі."
        },
        {
            "id": 1792,
            "header": "ПМ «Дошка оголошень»",
            "description": "Надання методистами оголошення для викладачів та студентів в межах визначеного підрозділу."
        },
        {
            "id": 1793,
            "header": "ПМ «Ректорський контроль»",
            "description": "Відображення в кабінеті студента результатів ректорського контролю якості залишкових знань (для 1-го та 4-го курсів)."
        },
        {
            "id": 1794,
            "header": "ПМ «Робочий навчальний план»",
            "description": "Відображення студентам, викладачам-науковцям на вибраний навчальний рік одного з основних нормативний документ університету, за допомогою якого здійснюється організація навчального процесу. РНП містить перелік кредитних модулів, що читаються в поточному навчальному році, конкретизує форми проведення навчальних занять, їх обсяг, форми і засоби поточного та підсумкового контролю за семестрами. РНП надає можливість перегляду методичного забезпечення по кожному з кредитних модулів."
        },
        {
            "id": 1795,
            "header": "ПМ «Навантаження НПП»",
            "description": "Надання можливості викладачам введення власного навантаження  для поточного навчального року. Основа для подальшого використання цих даних в ПМ «Поточний контроль», «Опитування»."
        },
        {
            "id": 1796,
            "header": "ПМ «Поточний контроль знань, умінь та навичок студентів»",
            "description": "Надання можливості у віртуальному кабінеті викладача вести відомість по кредитному модулю відповідно до власного навантаження (наприклад, лекція) з можливістю бачити сумарний бал студента з урахуванням оцінок, виставлених колегою, який веде інший вид навантаження (наприклад, лабораторна) та виставляти атестацію; у віртуальному кабінеті студента бачити не окремі відомості викладачів, а одну сумарну відомість по кредитному модулю, яка заповнюється викладачами паралельно, та переглядати результати атестації."
        },
        {
            "id": 1797,
            "header": "ПМ «Опитування»",
            "description": "Надання можливості проведення опитування серед студентського контингенту щодо оцінювання роботи професорсько-викладацького складу протягом навчального року."
        },
        {
            "id": 1798,
            "header": "ПМ «Куратор»",
            "description": "Надання можливості викладачу отримати перелік навчальних груп, в яких він викладає, з можливістю перегляду інформації про куратора групи, старости тощо; куратору навчальної групи отримати інформацію  про кожного студента в межах навчального процесу: фото, телефон, участь в опитуванні, результати атестації та ректорського контролю; методисту зазначити кураторів навчальних груп."
        }
    ];

    $scope.changeCollapsed = function () {
        console.log('collapsed');
        $scope.collapsed = !$scope.collapsed;
    }
}